[
    "I'm a software engineer with over 4 years of experience, currently exploring the intriguing world of generative AI with the Office AI team at Microsoft. I've been contributing to AI-powered productivity tools, with a primary focus on the M365 Copilot project.",
    "In my journey at Microsoft, I've had a hand in various projects that have made their way into production, won multiple awards for my contributions, filed a few patents, actively participated in the prototyping of new incubations, and seen my contributions showcased at notable conferences such as MS Build and GitHub Universe.",
    "I'm also proud of having initiated the GitHub Copilot Voice research project, known as \"Hey GitHub/Hello Cody: A Voice Assistant for VS Code\". This was a remarkable part of Microsoft's Global Hackathon. Post-victory, our team collaborated with GitHub Next, enhancing GitHub Copilot with voice interactions and pushing the boundaries of AI-assisted coding. This project also led to patent filings, another exciting accomplishment.",
    "Before my present role, I honed my skills as a full-stack software engineer in Microsoft's C+E group, developing enterprise applications for the sales domain using a wide array of web and data technologies. I had the opportunity to contribute to the ideation and development of multiple products that continue to be a critical part of Microsoft's sales workflows.",
    "While in college, I loved tinkering with Conversational AI and have crafted voice apps (Alexa Skills) both on my own and for clients and startups. Some of these apps have won awards in contests and hackathons hosted by Amazon. Feel free to check out these side projects on my website and view my contributions on GitHub.",
    "Outside my main job, I immerse myself in side projects and dive into hackathons. I've also always had a knack for teaching and sharing knowledge. I've been part of various volunteering initiatives, both within and outside Microsoft, with the aim of spreading the joy of programming.",
    "My tech toolkit includes TypeScript, ReactJS, JavaScript, Next JS, Python, Azure, Open AI APIs, Prompt Engineering and more."
  ]